clc;clear;
%% 创建9个IMU的标定参数结构体
% 定义9个IMU的数据
imuData(9).ab = [];  % 预分配

% IMU 1
imuData(1).ab = [0.010319, 0.007011, 0.381109];      % 加速度计零偏 (3×1)m/s^2
imuData(1).aK = [0.999283, 0.999545, 0.998584];  % 加计尺度因子矩阵 (3×3)
imuData(1).aT = [1,0,0; 0.000194835702478464,1,0; 0.000221060720695694, -0.00090584340631062,1];%rad/s                   % 加计安装误差矩阵 (3×3)
imuData(1).M_acc = inv(imuData(1).aT * diag(imuData(1).aK));

imuData(1).gb = [0.017024, -0.015964, 0.011333];         % 陀螺仪零偏 (3×1)rad/s
imuData(1).gK = [0.995027, 0.983334, 1.002272];  % 陀螺尺度因子矩阵 (3×3)
imuData(1).gT = [1,0.0156402223491315,-0.0294137578334188;
         0.013329920763958,1,0.0339479136823853;
        0.0146438840798759,0.000779668925333363,1];%rad/s                   % 陀螺安装误差矩阵 (3×3)
imuData(1).M_gyro = inv(imuData(1).gT * diag(imuData(1).gK));

% IMU 2
imuData(2).ab = [0.008114, 0.015955, 0.431479];      % 加速度计零偏 (3×1)
imuData(2).aK = [0.999781, 0.998950, 0.999065];  % 加计尺度因子矩阵 (3×3)
imuData(2).aT = [1,0,0; 2.27975455093168e-05,1,0; 0.000839175746276203, 6.94307179921054e-05,1];                   % 加计安装误差矩阵 (3×3)
imuData(2).M_acc = inv(imuData(2).aT * diag(imuData(2).aK));

imuData(2).gb = [0.049310, -0.030195, 0.006794];         % 陀螺仪零偏 (3×1)
imuData(2).gK = [0.995838, 0.980477, 1.003181];  % 陀螺尺度因子矩阵 (3×3)
imuData(2).gT = [1,0.0142547166717157,-0.0266732177947014;
        0.0134223048717114,1,0.0314034611193358;
        0.0155189088949631,0.00145242516590404,1];      % 陀螺安装误差矩阵 (3×3)
imuData(2).M_gyro = inv(imuData(2).gT * diag(imuData(2).gK));

% IMU 3
imuData(3).ab = [0.013866, 0.007813, 0.446641];      % 加速度计零偏 (3×1)
imuData(3).aK = [0.998388, 0.999615, 0.999814];  % 加计尺度因子矩阵 (3×3)
imuData(3).aT = [1,0,0; -0.000174212191094144,1,0; 0.00180848702830258, -0.00218289624175298,1];                   % 加计安装误差矩阵 (3×3)
imuData(3).M_acc = inv(imuData(3).aT * diag(imuData(3).aK));

imuData(3).gb = [0.006315, -0.068473, 0.036053];         % 陀螺仪零偏 (3×1)
imuData(3).gK = [0.999173, 0.990361, 1.001018];  % 陀螺尺度因子矩阵 (3×3)
imuData(3).gT = [1,0.0135132993917852,-0.0297725401615322;
        0.0172821008787144,1,0.0413877327932095;
        0.0226690641198936,0.00117178390606101,1];      % 陀螺安装误差矩阵 (3×3)
imuData(3).M_gyro = inv(imuData(3).gT * diag(imuData(3).gK));

% IMU 4
imuData(4).ab = [0.019346, 0.002930, 0.260780];      % 加速度计零偏 (3×1)
imuData(4).aK = [1.000014, 0.999227, 0.999663];  % 加计尺度因子矩阵 (3×3)
imuData(4).aT = [1,0,0; -4.77413849957941e-05,1,0; 0.00034966096021485, 4.16832528285888e-05,1];                   % 加计安装误差矩阵 (3×3)
imuData(4).M_acc = inv(imuData(4).aT * diag(imuData(4).aK));

imuData(4).gb = [0.022379, -0.019674, 0.013995];         % 陀螺仪零偏 (3×1)
imuData(4).gK = [0.993173, 0.981620, 1.001423];  % 陀螺尺度因子矩阵 (3×3)
imuData(4).gT = [1,0.0154541588321018,-0.0282531902306586;
        0.0136887232675832,1,0.032881690741398;
        0.0129656498974104,0.000848270604994734,1];      % 陀螺安装误差矩阵 (3×3)
imuData(4).M_gyro = inv(imuData(4).gT * diag(imuData(4).gK));



% IMU 5
imuData(5).ab = [0.036862, -0.013776, 0.310732];      % 加速度计零偏 (3×1)
imuData(5).aK = [0.998815, 0.999580, 0.999138];  % 加计尺度因子矩阵 (3×3)
imuData(5).aT = [1,0,0; 3.38595874534155e-05,1,0; 6.45897964695685e-06, -0.00149917307546896,1];                   % 加计安装误差矩阵 (3×3)
imuData(5).M_acc = inv(imuData(5).aT * diag(imuData(5).aK));

imuData(5).gb = [0.020699, -0.017888, 0.017475];         % 陀螺仪零偏 (3×1)
imuData(5).gK = [0.990501, 0.983723, 1.000804];  % 陀螺尺度因子矩阵 (3×3)
imuData(5).gT = [1        ,0.0136517325141636       ,-0.0275211467319483;
        0.0120897229502893                         ,1        ,0.0341707620989517;
        0.0130389068998445      ,-0.00295949227506389                         ,1];      % 陀螺安装误差矩阵 (3×3)
imuData(5).M_gyro = inv(imuData(5).gT * diag(imuData(5).gK));



% IMU 6
imuData(6).ab = [0.012097, 0.028356, 0.360490];      % 加速度计零偏 (3×1)
imuData(6).aK = [0.999322, 0.999768, 0.999563];  % 加计尺度因子矩阵 (3×3)
imuData(6).aT = [1,0,0; -7.49601822817198e-05,1,0; 0.00186894949896308, -0.00182569181642078,1];                   % 加计安装误差矩阵 (3×3)
imuData(6).M_acc = inv(imuData(6).aT * diag(imuData(6).aK));

imuData(6).gb = [0.022086, -0.041890, 0.033433];         % 陀螺仪零偏 (3×1)
imuData(6).gK = [0.993203, 0.979224, 1.003728];  % 陀螺尺度因子矩阵 (3×3)
imuData(6).gT = [1,        0.0153175578593669,       -0.0232196085672908;
        0.0178080240400708,                         1,        0.0323523718183362;
        0.0203692042536575,      -0.00439720875892553,                         1];      % 陀螺安装误差矩阵 (3×3)
imuData(6).M_gyro = inv(imuData(6).gT * diag(imuData(6).gK));



% IMU 7
imuData(7).ab = [0.004166, 0.012716, 0.238236];      % 加速度计零偏 (3×1)
imuData(7).aK = [0.998661, 0.999540, 0.998958];  % 加计尺度因子矩阵 (3×3)
imuData(7).aT = [1,0,0; 8.73252066575483e-05,1,0; -0.000622914421027176, 0.00075208286646819,1];                   % 加计安装误差矩阵 (3×3)
imuData(7).M_acc = inv(imuData(7).aT * diag(imuData(7).aK));

imuData(7).gb = [0.040856, -0.014193, 0.001908];         % 陀螺仪零偏 (3×1)
imuData(7).gK = [0.997411, 0.979614, 1.006787];  % 陀螺尺度因子矩阵 (3×3)
imuData(7).gT = [1,        0.0160991502779631,       -0.0289386300040769;
        0.0136196811242235,                         1,        0.0299256772825214;
       0.00467714165039471,        0.0026201403500552,                         1];      % 陀螺安装误差矩阵 (3×3)
imuData(7).M_gyro = inv(imuData(7).gT * diag(imuData(7).gK));



% IMU 8
imuData(8).ab = [0.020207, 0.005439, 0.156945];      % 加速度计零偏 (3×1)
imuData(8).aK = [0.996959, 0.998625, 0.998608];  % 加计尺度因子矩阵 (3×3)
imuData(8).aT = [1,0,0; -5.48283746023293e-05,1,0; -0.000364669441646837, -0.000385812227621926,1];                   % 加计安装误差矩阵 (3×3)
imuData(8).M_acc = inv(imuData(8).aT * diag(imuData(8).aK));

imuData(8).gb = [0.006392, -0.009287, -0.000989];         % 陀螺仪零偏 (3×1)
imuData(8).gK = [0.996864, 0.983289, 1.003332];  % 陀螺尺度因子矩阵 (3×3)
imuData(8).gT = [1,        0.0159823316266253,       -0.0310653034773719;
        0.0129588408179253,                         1,        0.0325513858387925;
        0.0074186164405916,       0.00436817079582251,                         1];      % 陀螺安装误差矩阵 (3×3)
imuData(8).M_gyro = inv(imuData(8).gT * diag(imuData(8).gK));



% IMU 9
imuData(9).ab = [0.004211, 0.009292, 0.259148];      % 加速度计零偏 (3×1)
imuData(9).aK = [0.999431, 0.999215, 0.999127];  % 加计尺度因子矩阵 (3×3)
imuData(9).aT = [1,0,0; -0.000131395234009569,1,0; -0.0002809770769734, -0.000636355962879744,1];                   % 加计安装误差矩阵 (3×3)
imuData(9).M_acc = inv(imuData(9).aT * diag(imuData(9).aK));

imuData(9).gb = [0.013106, -0.005487, 0.013116];         % 陀螺仪零偏 (3×1)
imuData(9).gK = [0.996284, 0.984997, 1.002037];  % 陀螺尺度因子矩阵 (3×3)
imuData(9).gT = [1,        0.0152808712777512,       -0.0316424560801209;
        0.0127650586854483,                         1,        0.0343905636960887;
        0.0123490858174986,       0.00417800176476085,                         1];      % 陀螺安装误差矩阵 (3×3)
imuData(9).M_gyro = inv(imuData(9).gT * diag(imuData(9).gK));

% 保存为.mat文件
save('imu_calibration_params.mat', 'imuData');
disp('标定参数已保存到 imu_calibration_params.mat');

